dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
#ifndef _W801DUINO_H
#define _W801DUINO_H

//Arduino clone for W801: 32-bit C_SKY chip from Winner Micro
//version history
// v0.1: 09/30/2022 - initial development, from STM32Duino
// v0.2: 10/01/2022 - ported over GPIO, ticks, and uart functions
// v0.3: 10/02/2022 - clock management ported over initially
// v0.4: 10/08/2022 - CDK workflow automated
// v0.5: 10/14/2022 - adc implemented
// v0.6: 10/15/2022 - fixed systick(): needed "volatile" on two variables -> likely a compiler bug
// v0.7: 10/15/2022 - RTC, PWM and ADC (temp/Vcc) are working.
// v0.7a:10/22/2022 - software i2c added
// v0.7b:10/26/2022 - true / pseudo random number generator implemented
// v0.7c:11/05/2022 - arand1/4/8/16/32(): using adc to generate random numbers
// v0.7d:11/29/2022 - added circular buffer
// v0.7e:12/23/2022 - implemented uart transmission over a circular buffer
//
//
//
//               |=======================|
//               |                       |
//     40M Xtal->|                  PB19 |>---------> UART0TX
//               |                  PB20 |<---------< UART0RX
//               |                       |
//               |                       |
//               |                  PB11 |>---------> LED0 (active low)
//               |                  PB16 |>---------> LED1 (active low)
//               |                  PB17 |>---------> LED2 (active low)
//               |                  PB18 |>---------> LED3 (active low)
//               |                  PB26 |>---------> LED4 (active low)
//               |                  PB25 |>---------> LED5 (active low)
//               |                  PB5  |>---------> LED6 (active low)
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |                       |
//               |=======================|
//
//
//
#include <stdio.h>							//we use *FILE in fputc()
#include <string.h>							//we use strcpy
#include "wm_hal.h"							//we use w806sdk

//configuration
//#define USE_HALGPIO						//use hal for gpio
//#define USE_HALUART						//use hal for uart
//#define USE_HALTICK						//use hal tick for time base generation (1ms default). othrewise, in 1/F_CPU ticks
#define CPU_CLK			CPU_CLK_10M			//cpu speed, 240M/160M/80M/40M/2M + 120M/24M/20M/12M/10M/8M/4M
#define uRAM_SIZE		32					//uxPrint buffer size, in bytes

//configuration for circular buffer
/*******NOTE********************************/
/******cBUFF_SIZE: must be power of 2*******/
/*******************************************/
#define cBUFF_SIZE 		256					//must be power of 2: 0..256 -> for buffers with more than 256 elements, change data type for writeIndex/readIndex
typedef char cbuffer_t;						//storage unit for the buffer
//end configuration for circular buffer

//uart pin assignments
//#define UART0TX2PIN()	UART0TX2PB19()		//assign uart0 tx to a pin: pb19, pb27
//#define UART0RX2PIN()	UART0RX2PB20()		//assign uart0 rx to a pin: pb20, pb28
#define UART1TX2PIN()	UART1TX2PB6()		//assign uart1 tx to a pin: pb6 , pb31
#define UART1RX2PIN()	UART1RX2PB7()		//assign uart1 rx to a pin: pb7 , pb16
#define UART2TX2PIN()	UART2TX2PB2()		//assign uart2 tx to a pin: pb2 , pa2
#define UART2RX2PIN()	UART2RX2PB3()		//assign uart2 rx to a pin: pb3 , pa3
#define UART3TX2PIN()	UART3TX2PB0()		//assign uart3 tx to a pin: pb0 , pa5
#define UART3RX2PIN()	UART3RX2PB1()		//assign uart3 rx to a pin: pb1 , pa6
#define UART4TX2PIN()	UART4TX2PB4()		//assign uart4 tx to a pin: pb4 , pa8
#define UART4RX2PIN()	UART4RX2PB5()		//assign uart4 rx to a pin: pb5 , pa9
#define UART5TX2PIN()	UART5TX2PB18()		//assign uart4 tx to a pin: pa12, pa8 , pb18
#define UART5RX2PIN()	UART5RX2PA13()		//assign uart4 rx to a pin: pa13, pa9 , pb17

//pwm pin assignments
#define PWM02PIN()		PWM02PB0()			//assign pwm pins: pb0 , pa2 , pa10, pb12, pb19
#define PWM12PIN()		PWM12PB1()			//assign pwm pins: pb1 , pa3 , pa11, pb13, pb20
#define PWM22PIN()		PWM22PB2()			//assign pwm pins: pb2 , pa0 , pa12, pb14, pb24
#define PWM32PIN()		PWM32PB25()			//assign pwm pins: pb3 , pa1 , pa13, pb15, pb25
#define PWM42PIN()		PWM42PB16()			//assign pwm pins: pa7 , pa4 , pa14, pb16, pb26

//adc pins - fixed
#define ADC02PIN()		ADC02PA1()			//adc0 input is PA1
#define ADC12PIN()		ADC12PA2()			//adc1 input is PA2
#define ADC22PIN()		ADC22PA3()			//adc2 input is PA3
#define ADC32PIN()		ADC32PA4()			//adc3 input is PA4

//spi pins
#define SPISCK2PIN()	SPISCK2PB1()		//spi sck  to pb1, pb2, pb15, pb24
#define SPIMOSI2PIN()	SPIMOSI2PA7()		//spi mosi to pa7, pb5, pb17, pb26
#define SPIMISO2PIN()	SPIMISO2PB0()		//spi miso to pb0, pb3, pb16, pb25

//i2c pins
#define I2CSCL2PIN()	I2CSCL2PA1()		//i2c scl to pa1, pb20
#define I2CSDA2PIN()	I2CSDA2PA2()		//i2c sda to pa2, pb19

#define sI2CSCLPIN		PB1					//software i2c scl pin
#define sI2CSDAPIN		PB2					//software i2c sda pin

#define LED0			PB11
#define LED1			PB16
#define LED2			PB17
#define LED3			PB18
#define LED4			PB26
#define LED5			PB25
#define LED6			PB5
//end configuration

//global defines
#define F_PLL			(480000000ul)		//dpll output frequency, fixed at 480Mhz
#define F_CPU			SystemCoreClock()	//return system coreclock
#define F_WLAN			WLANClock()			//wlan clock
#define F_PHB			APBClock()			//periopheral clock - needs more work***
#define SysTick_PR		(1<<24)				//systick period
#define F_ADC			1000				//adc frequency, 1000Hz max
#define F_SPI			1000000ul			//spi speed
#define F_I2C			400000ul			//i2c speed
#define F_sI2C			100000ul			//frquency for software i2c

//per datasheet, this controls the VCM input to the PGA, thus the adc results. 
//only applied in single ended mode (ADC_CH0..3)
//cannot be found in the header files however :)
//bit 16..11, 0x3f max. VCM = 1.311v, step = 39.1mv
#define PGA_VCMIN		(*(volatile uint32_t *) (0x40000D20))	

//only use the cpu divider values below to set clocks
//all other clocks are configured from CPU clock
//additional CPU_CLK values
//must be divisible by 12
#define CPU_CLK_120M	4					//480/4 =120Mhz
//>12: CLK_CLK must be multiples of 4
#define CPU_CLK_24M		20					//480/20=24Mhz
#define CPU_CLK_20M		24					//480/24=20Mhz
#define CPU_CLK_12M		40					//480/40=12Mhz
#define CPU_CLK_10M		48					//480/48=10Mhz
#define CPU_CLK_8M		60					//480/60=8Mhz
#define CPU_CLK_4M		120					//480/120=4Mhz
//configure systemcoreclock
#define SystemCoreClock10MHZ()				SystemCoreClockConfig(CPU_CLK_10M)
#define SystemCoreClock20MHZ()				SystemCoreClockConfig(CPU_CLK_20M)
#define SystemCoreClock40MHZ()				SystemCoreClockConfig(CPU_CLK_40M)
#define SystemCoreClock80MHZ()				SystemCoreClockConfig(CPU_CLK_80M)
#define SystemCoreClock120MHZ()				SystemCoreClockConfig(CPU_CLK_120M)
#define SystemCoreClock240MHZ()				SystemCoreClockConfig(CPU_CLK_240M)

