dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//pin assignment macros
//uart pin assignments
#define UART0TX2PB19()	pinAFIO(PB19, 1)	//uart0 TX to PB19, 0b00
#define UART0TX2PB27()	pinAFIO(PB27, 2)	//uart0 TX to PA27, 0b01
#define UART0RX2PB20()	pinAFIO(PB20, 1)	//uart0 RX to PB20, 0b00
#define UART0RX2PB28()	pinAFIO(PB28, 2)	//uart0 RX to PB28, 0b01

#define UART1TX2PB6()	pinAFIO(PB6 , 1)	//uart1 TX to PB6 , 0b00
#define UART1TX2PB31()	pinAFIO(PB31, 2)	//uart1 TX to PB31, 0b01
#define UART1RX2PB7()	pinAFIO(PB7 , 1)	//uart1 RX to PB7 , 0b00
#define UART1RX2PB16()	pinAFIO(PB16, 4)	//uart1 RX to PB16, 0b11

#define UART2TX2PB2()	pinAFIO(PB2 , 3)	//uart2 TX to PB2 , 0b10
#define UART2TX2PA2()	pinAFIO(PA2 , 2)	//uart2 TX to PA2 , 0b01
#define UART2RX2PB3()	pinAFIO(PB3 , 3)	//uart2 RX to PB3 , 0b10
#define UART2RX2PA3()	pinAFIO(PA3 , 2)	//uart2 RX to PA3 , 0b01

#define UART3TX2PB0()	pinAFIO(PB0 , 3)	//uart3 TX to PB0 , 0b10
#define UART3TX2PA5()	pinAFIO(PA5 , 1)	//uart3 TX to PA5 , 0b00
#define UART3RX2PB1()	pinAFIO(PB1 , 3)	//uart3 RX to PB1 , 0b10
#define UART3RX2PA6()	pinAFIO(PA6 , 1)	//uart3 RX to PA6 , 0b00

#define UART4TX2PB4()	pinAFIO(PB4 , 3)	//uart4 TX to PB4 , 0b10
#define UART4TX2PA8()	pinAFIO(PA8 , 2)	//uart4 TX to PA8 , 0b01
#define UART4RX2PB5()	pinAFIO(PB5 , 3)	//uart4 RX to PB5 , 0b10
#define UART4RX2PA9()	pinAFIO(PA9 , 2)	//uart4 RX to PA9 , 0b01

#define UART5TX2PA12()	pinAFIO(PA12, 2)	//uart5 TX to PA12, 0b01
#define UART5TX2PA8()	pinAFIO(PA8 , 3)	//uart5 TX to PA8 , 0b10
#define UART5TX2PB18()	pinAFIO(PB18, 1)	//uart5 TX to PB18, 0b00
#define UART5RX2PA13()	pinAFIO(PA13, 2)	//uart5 RX to PA13, 0b01
#define UART5RX2PA9()	pinAFIO(PA9 , 3)	//uart5 RX to PA9 , 0b10
#define UART5RX2PB17()	pinAFIO(PB17, 1)	//uart5 RX to PB17, 0b00

//pwm pin assignments
#define PWM02PB0()		pinAFIO(PB0 , 1)	//pwm0 to pb0 , 0b00
#define PWM02PB19()		pinAFIO(PB19, 2)	//pwm0 to pb19, 0b01
#define PWM02PB12()		pinAFIO(PB12, 2)	//pwm0 to pb12, 0b01
#define PWM02PA2()		pinAFIO(PA2 , 3)	//pwm0 to pa2 , 0b10
#define PWM02PA10()		pinAFIO(PA10, 3)	//pwm0 to pa10, 0b10

#define PWM12PB1()		pinAFIO(PB1 , 1)	//pwm1 to pb1 , 0b00
#define PWM12PB20()		pinAFIO(PB20, 2)	//pwm1 to pb20, 0b01
#define PWM12PB13()		pinAFIO(PB13, 3)	//pwm1 to pb13, 0b10
#define PWM12PA3()		pinAFIO(PA3 , 3)	//pwm1 to pa3 , 0b10
#define PWM12PA11()		pinAFIO(PA11, 3)	//pwm1 to pa11, 0b10

#define PWM22PA0()		pinAFIO(PA0 , 3)	//pwm2 to pa0, 0b10
#define PWM22PB2()		pinAFIO(PB2 , 1)	//pwm2 to pb2, 0b00
#define PWM22PA12()		pinAFIO(PA12, 3)	//pwm2 to pb12, 0b10
#define PWM22PB14()		pinAFIO(PB14, 2)	//pwm2 to pb14, 0b01
#define PWM22PB24()		pinAFIO(PB24, 2)	//pwm2 to pb24, 0b01

#define PWM32PA1()		pinAFIO(PA1 , 3)	//pwm1 to pa1 , 0b10
#define PWM32PB3()		pinAFIO(PB3 , 1)	//pwm1 to pb3 , 0b00
#define PWM32PA13()		pinAFIO(PA13, 3)	//pwm1 to pa13, 0b10
#define PWM32PB15()		pinAFIO(PB15, 2)	//pwm1 to pb15, 0b01
#define PWM32PB25()		pinAFIO(PB25, 2)	//pwm1 to pb25, 0b01

#define PWM42PA4()		pinAFIO(PA4 , 3)	//pwm4 to pa4 , 0b10
#define PWM42PA7()		pinAFIO(PA7 , 1)	//pwm4 to pa7 , 0b00
#define PWM42PA14()		pinAFIO(PA14, 3)	//pwm4 to pa14, 0b10
#define PWM42PB16()		pinAFIO(PB16, 2)	//pwm4 to pb16, 0b01
#define PWM42PB26()		pinAFIO(PB26, 2)	//pwm4 to pb26, 0b01

//adc input pins
//why enable pullup? wh_gpio_ex.h has the same setting for opt6 and opt7.
//set PULLUP_EN to disable pullup, clear pullup_en to enable pullup
//set pulldown_en to enable pulldown, clear PULLDOWN_EN to disable pulldown
#define ADC02PA1()		pinAFIO(PA1, 7)		//do {IO_CLR(GPIOA->AF_SEL, 1<<1); IO_CLR(GPIOA->DIR, 1<<1); IO_SET(GPIOA->PULLUP_EN, 1<<1); IO_CLR(GPIOA->PULLDOWN_EN, 1<<1);} while (0)
#define ADC12PA2()		pinAFIO(PA2, 7)		//do {IO_CLR(GPIOA->AF_SEL, 1<<2); IO_CLR(GPIOA->DIR, 1<<2); IO_SET(GPIOA->PULLUP_EN, 1<<2); IO_CLR(GPIOA->PULLDOWN_EN, 1<<2);} while (0)
#define ADC22PA3()		pinAFIO(PA3, 7)		//do {IO_CLR(GPIOA->AF_SEL, 1<<3); IO_CLR(GPIOA->DIR, 1<<3); IO_SET(GPIOA->PULLUP_EN, 1<<3); IO_CLR(GPIOA->PULLDOWN_EN, 1<<3);} while (0)
#define ADC32PA4()		pinAFIO(PA4, 7)		//do {IO_CLR(GPIOA->AF_SEL, 1<<4); IO_CLR(GPIOA->DIR, 1<<4); IO_SET(GPIOA->PULLUP_EN, 1<<4); IO_CLR(GPIOA->PULLDOWN_EN, 1<<4);} while (0)

//spi pin assignments
#define SPISCK2PB1()	pinAFIO(PB1, 2)		//spi sck to pb1 , opt2
#define SPISCK2PB2()	pinAFIO(PB2, 2)		//spi sck to pb2 , opt2
#define SPISCK2PB15()	pinAFIO(PB15,3)		//spi sck to pb15, opt3
#define SPISCK2PB24()	pinAFIO(PB24,1)		//spi sck to pb24, opt1

#define SPIMOSI2PA7()	pinAFIO(PA7, 2)		//spi mosi to pa7, opt2
#define SPIMOSI2PB5()	pinAFIO(PB5, 1)		//spi mosi to pb5, opt1
#define SPIMOSI2PB17()	pinAFIO(PB17,3)		//spi mosi to pb17,opt3
#define SPIMOSI2PB26()	pinAFIO(PB26,1)		//spi mosi to pb26,opt1

#define SPIMISO2PB0()	pinAFIO(PB0, 2)		//spi miso to pb0, opt2
#define SPIMISO2PB3()	pinAFIO(PB3, 2)		//spi miso to pb3, opt2
#define SPIMISO2PB16()	pinAFIO(PB16,3)		//spi miso to pb16,opt3
#define SPIMISO2PB25()	pinAFIO(PB25,1)		//spi miso to pb25,opt1

//i2c pin assignments
#define I2CSCL2PA1()	pinAFIO(PA1, 2)		//i2c scl to pa1, opt2
#define I2CSCL2PB20()	pinAFIO(PB20,4)		//i2c scl to pb20,opt4
#define I2CSDA2PA2()	pinAFIO(PA2, 2)		//i2c sda to pa2, opt2
#define I2CSDA2PB19()	pinAFIO(PB19,4)		//i2c sda to pb19,opt4

//macros that should have been in the header file!
#define ISR				__attribute__((isr))		//declare isr

//reg maniputation macros - the OEM macros are too painful to use
#define REG_WRITE(reg, val)		tls_reg_write32(reg, val)
#define REG_READ(reg)			tls_reg_read32(reg)
#define REG_SET(reg, bits)		REG_WRITE(reg, REG_READ(reg) | (bits))
#define REG_CLR(reg, bits)		REG_WRITE(reg, REG_READ(reg) &~(bits))
#define REG_FLP(reg, bits)		REG_WRITE(reg, REG_READ(reg) ^ (bits))
#define REG_GET(reg)			REG_READ(reg)

//circular buffer
//circular buffer to store char
typedef struct {
    cbuffer_t buffer[cBUFF_SIZE];		//buffer
    uint8_t writeIndex;					//index for the current write-> advance first and then write
    uint8_t readIndex;					//index for the current read -> advance first and then read
} CB_TypeDef;

