dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//gpio
//port manipulation macros for PIC.
//port/gpio oriented macros
#define IO_SET(port, pins)					port |= (pins)				//set bits on port
#define IO_CLR(port, pins)					port &=~(pins)				//clear bits on port
#define IO_FLP(port, pins)					port ^= (pins)				//flip bits on port
#define IO_GET(port, pins)					((port) & (pins))			//return bits on port
//gpio port based
#define GIO_SET(port, pins)					IO_SET(port->DATA, (pins))				//set bits on port
#define GIO_CLR(port, pins)					IO_CLR(port->DATA, (pins))				//clear bits on port
#define GIO_FLP(port, pins)					IO_FLP(port->DATA, (pins))				//flip bits on port
#define GIO_GET(port, pins)					IO_GET(port->DATA, (pins))			//return bits on port
//set a pin to output/input
#define GIO_OUT(port, pins)					IO_SET(port->DIR, pins)					//_GPIO_Init(GPIOx, GPIO_Pins, GPIO_MODE_OUT_PP_LOW_FAST)
#define GIO_IN(port, pins)					IO_CLR(port->DIR, pins)					//IO_IN(port, pins)				//_GPIO_Init(GPIOx, GPIO_Pins, GPIO_MODE_IN_FL_NO_IT)

//pin enum - matches GPIO_PinDef[]
//not all ports / pins are available
typedef enum {
#if defined(GPIOA)
	PA0, PA1, PA2, PA3, PA4, PA5, PA6, PA7, PA8, PA9, PA10, PA11, PA12, PA13, PA14, PA15,
	PA16,PA17,PA18,PA19,PA20,PA21,PA22,PA23,PA24,PA25,PA26, PA27, PA28, PA29, PA30, PA31,
#endif		//GPIOA
#if defined(GPIOB)
	PB0, PB1, PB2, PB3, PB4, PB5, PB6, PB7, PB8, PB9, PB10, PB11, PB12, PB13, PB14, PB15,
	PB16,PB17,PB18,PB19,PB20,PB21,PB22,PB23,PB24,PB25,PB26, PB27, PB28, PB29, PB30, PB31,
#endif		//GPIOB
#if defined(GPIOC)
	PC0, PC1, PC2, PC3, PC4, PC5, PC6, PC7, PC8, PC9, PC10, PC11, PC12, PC13, PC14, PC15,
	PC16,PC17,PC18,PC19,PC20,PC21,PC22,PC23,PC24,PC25,PC26, PC27, PC28, PC29, PC30, PC31,
#endif		//GPIOC
#if defined(GPIOD)
	PD0, PD1, PD2, PD3, PD4, PD5, PD6, PD7, PD8, PD9, PD10, PD11, PD12, PD13, PD14, PD15,
	PD16,PD17,PD18,PD19,PD20,PD21,PD22,PD23,PD24,PD25,PD26, PD27, PD28, PD29, PD30, PD31,
#endif		//GPIOD
#if defined(GPIOE)
	PE0, PE1, PE2, PE3, PE4, PE5, PE6, PE7, PE8, PE9, PE10, PE11, PE12, PE13, PE14, PE15,
	PE16,PE17,PE18,PE19,PE20,PE21,PE22,PE23,PE24,PE25,PE26, PE27, PE28, PE29, PE30, PE31,
#endif		//GPIOE
#if defined(GPIOF)
	PF0, PF1, PF2, PF3, PF4, PF5, PF6, PF7, PF8, PF9, PF10, PF11, PF12, PF13, PF14, PF15,
	PF16,PF17,PF18,PF19,PF20,PF21,PF22,PF23,PF24,PF25,PF26, PF27, PF28, PF29, PF30, PF31,
#endif		//GPIOF
#if defined(GPIOG)
	PG0, PG1, PG2, PG3, PG4, PG5, PG6, PG7, PG8, PG9, PG10, PG11, PG12, PG13, PG14, PG15,
	PG16,PG17,PG18,PG19,PG20,PG21,PG22,PG23,PG24,PG25,PG26, PG27, PG28, PG29, PG30, PG31,
#endif		//GPIOG
#if defined(GPIOH)
	PH0, PH1, PH2, PH3, PH4, PH5, PH6, PH7, PH8, PH9, PH10, PH11, PH12, PH13, PH14, PH15,
	PH16,PH17,PH18,PH19,PH20,PH21,PH22,PH23,PH24,PH25,PH26, PH27, PH28, PH29, PH30, PH31,
#endif		//GPIOH
	PMAX
} PIN_TypeDef;

//map pin number to GPIOx
typedef struct {
	GPIO_TypeDef *gpio;					//gpio for a pin
	uint32_t mask;						//pin mask - 16-bit port
} PIN2GPIO;

//end gpio

//systick/coret
//end systick/coret

//arduino declaration
#define INPUT				0
#define OUTPUT				1			//(!INPUT)
#define PULLUP				2
#define PULLDOWN			3

#define LOW					0
#define HIGH				(!LOW)

#define PI 					3.1415926535897932384626433832795
#define HALF_PI 			(PI / 2)							//1.5707963267948966192313216916398
#define TWO_PI 				(PI + PI)							//6.283185307179586476925286766559
#define DEG_TO_RAD 			(TWO_PI / 360)						//0.017453292519943295769236907684886
#define RAD_TO_DEG 			(360 / TWO_PI)						//57.295779513082320876798154814105
#define EULER 				2.718281828459045235360287471352	//Euler's number

#define SERIAL  			0x0
#define DISPLAY 			0x1

#define LSBFIRST 			0
#define MSBFIRST 			1									//(!LSBFIRST)							//1

#define CHANGE 				1
#define FALLING 			2
#define RISING 				3

#ifndef min
#define min(a,b) 			((a)<(b)?(a):(b))
#endif
#ifndef max
#define max(a,b) 			((a)>(b)?(a):(b))
#endif
#define abs(x) 				((x)>0?(x):-(x))
#define constrain(amt,low,high) ((amt)<(low)?(low):((amt)>(high)?(high):(amt)))
//#define round(x)     		((x)>=0?(long)((x)+0.5):(long)((x)-0.5))
#define radians(deg) 		((deg)*DEG_TO_RAD)
#define degrees(rad) 		((rad)*RAD_TO_DEG)
#define sq(x) 				((x)*(x))

#define interrupts() 		ei()
#define noInterrupts() 		di()

#define clockCyclesPerMillisecond() 	( F_CPU / 1000L )
#define clockCyclesPerMicrosecond() 	( F_CPU / 1000000L )
#define clockCyclesToMicroseconds(a) 	( (a) / clockCyclesPerMicrosecond() )
#define microsecondsToClockCycles(a) 	( (a) * clockCyclesPerMicrosecond() )

#define lowByte(w) 			((uint8_t) ((w) & 0xff))
#define highByte(w) 		((uint8_t) ((w) >> 8))

#define bitRead(value, bit) (((value) >> (bit)) & 0x01)
#define bitSet(value, bit) 	((value) |= (1UL << (bit)))
#define bitClear(value, bit) ((value) &= ~(1UL << (bit)))
#define bitWrite(value, bit, bitvalue) (bitvalue ? bitSet(value, bit) : bitClear(value, bit))
#define bit(n)				(1ul<<(n))

#define false				0
#define true				1

//characters
#define isAlphaNumeric(c)	isalnum(c)
#define isAlpha(c)			isalpha(c)
#define isAscii(c)			isascii(c)
#define isWhitespace(c)		isblank(c)
#define isControl(c)		iscntrl(c)
#define isDigit(c)			isdigit(c)
#define isGraph(c)			isgraph(c)
#define isLowerCase(c)		islower(c)
#define isPrintable(c)		isprint(c)
#define isPunct(c)			ispunct(c)
#define isSpace(c)			isspace(c)
#define isUpperCase(c)		isupper(c)
#define isHexadecimalDigit(c)	isxdigit(c)

//external setup/loop - defined by user
extern void setup(void);
extern void loop(void);

//interrupts
#define ei()				__enable_irq()				//enable global interrupt
#define di()				__disable_irq()				//disable global interrupt

//random number
#define randomSeed(seed)	srand(seed)
#define random(max)			random2(0, max)
#define random2(min, max)	((min) + (int32_t) ((max) - (min)) * rand() / 32768)

//GPIO
#define inline											//suppress inline
inline void pinMode(PIN_TypeDef pin, uint8_t mode);
inline void digitalWrite(PIN_TypeDef pin, uint8_t mode);
inline int digitalRead(PIN_TypeDef pin);
#define pinFlip(pin)		digitalWrite(pin, !digitalRead(pin))
inline void pinPullup(PIN_TypeDef pin, uint8_t val);	//enable pull-up
inline void pinPulldown(PIN_TypeDef pin, uint8_t val);	//enable pull-down
inline void pinAFIO(PIN_TypeDef pin, uint8_t af); 		//configure alternative functions

