dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//time base
uint32_t systicks(void);								//use systick as time base
#define ticks()				systicks()					//use coretick / dwt for timing / tick generation
#define coreticks()			systicks()					//use dwt/coretick as time base

#define millis()			(ticks() / cyclesPerMillisecond())
#define micros()			(ticks() / cyclesPerMicrosecond())
void delayTks(uint32_t tks);							//delay a given number of ticks
//void delayUs(uint32_t us);							//delay a given number of micro seconds
//void delayMs(uint32_t ms);							//delay a given number of millie seconds
#define delayUs(us)				delayTks((us) * cyclesPerMicrosecond())
#define delayMs(ms)				delayTks((ms) * cyclesPerMillisecond())
#define delay(ms)				delayMs(ms)
#define delayMilliseconds(ms)	delayMs(ms)
#define delayMicroseconds(us)	delayUs(us)
#define cyclesPerMicrosecond()			(F_CPU / 1000000ul)
#define cyclesPerMillisecond()			(F_CPU / 1000)

//install systick isr
//activate the isr handler
void systickAttachISR(void (*isrptr)(void));
#define systickDetachISR()		systickAttachISR(empty_handler())

//advanced IO
//void tone(void);										//tone frequency specified by F_TONE in STM8Sduino.h
//void noTone(void);
//shiftin/out: bitOrder = MSBFIRST or LSBFIRST
uint8_t shiftIn(PIN_TypeDef dataPin, PIN_TypeDef clockPin, uint8_t bitOrder);
void shiftOut(PIN_TypeDef dataPin, PIN_TypeDef clockPin, uint8_t bitOrder, uint8_t val);
uint32_t pulseIn(PIN_TypeDef pin, uint8_t state);		//wait for a pulse and return timing

//pwm output
//dc = 0x00..0x0fff for pwm2/3/4/5, 0x00..0xffff for pwm1
//RP4=PWM1, RP12=PWM2, RP13=PWM3, RP14=PWM4, RP15=PWM5
void analogWrite(uint8_t pin, uint16_t dc);				//not implemented - could use a wrapper however.

//analog read on ADC1
//read DRL first for right aligned results
//uint16_t analogRead(uint8_t pin);

//analog reference - default to AVdd-AVss
//Vref sources: 0->Vref = AVdd-AVss, 1->Vref+-AVss, 2->AVdd-Vref-, 3->Vref+ - Vref-
//void analogReference(uint8_t Vref);

//interrupts
//install external interrupt handler
//mode 1: falling edge, 0: rising edge
//void attachInterrupt(uint8_t intx, void (*isrptr) (void), uint8_t mode);
//void detachInterrupt(uint8_t intx);

//change notification interrupts
//install user CN interrupt handler
//void attachCNInterrupt(void (*isrptr) (void));
//void detachCNInterrupt(void);
//void activateCNInterrupt(uint8_t cnx, uint8_t pue);
//void deactivateCNInterrupt(uint8_t cnx);

//global variables

//return system core clock
uint32_t SystemCoreClockConfig(uint32_t clk);		//config system clocks (F_CPU, F_WLAN and F_APB), return F_CPU
uint32_t SystemCoreClockUpdate(void);				//update F_CPU, F_WLAN and F_APB, return F_CPU
uint32_t SystemCoreClock(void);						//return F_CPU
uint32_t WLANClock(void);							//return F_WLAN
uint32_t APBClock(void);							//return F_APB

//reset the mcu
void mcuInit(void);

//empty interrupt handler
void empty_handler(void);


#define Mhz					000000ul	//suffix for Mhz
#define F_UART				(F_PHB)		//8Mhz		//crystal frequency
#define UART_BR300			300ul		//buadrate=300
#define UART_BR600			600ul		//buadrate=600
#define UART_BR1200			1200ul		//buadrate=1200
#define UART_BR2400			2400ul		//buadrate=2400
#define UART_BR4800			4800ul		//buadrate=4800
#define UART_BR9600			9600ul		//buadrate=9600
#define UART_BR14400		14400ul		//buadrate=19200
#define UART_BR19200		19200ul		//buadrate=19200
#define UART_BR38400		38400ul		//buadrate=38400
#define UART_BR43000		43000ul		//buadrate=38400
#define UART_BR57600		57600ul		//buadrate=57600
#define UART_BR76800		76800ul		//buadrate=57600
#define UART_BR115200		115200ul	//buadrate=115200
#define UART_BR128000		128000ul	//buadrate=115200
#define UART_BR230400		230400ul	//buadrate=115200
#define UART_BR256000		256000ul	//buadrate=115200
#define UART_BR460800		460800ul	//buadrate=115200
#define UART_BR512000		512000ul	//buadrate=115200
#define UART_BR576000		576000ul	//buadrate=115200
#define UART_BR921600		921600ul	//buadrate=115200
#define UART_BR1000000		1000000ul	//buadrate=115200
#define UART_BR1250000		1250000ul	//buadrate=115200
#define UART_BR1500000		1500000ul	//buadrate=115200
#define UART_BR2000000		2000000ul	//buadrate=115200
//short notations
#define UART_BR0K3			UART_BR300
#define UART_BR0K6			UART_BR600
#define UART_BR1K2			UART_BR1200
#define UART_BR2K4			UART_BR2400
#define UART_BR4K8			UART_BR4800
#define UART_BR9K6			UART_BR9600
#define UART_BR14K4			UART_BR14400
#define UART_BR19K2			UART_BR19200
#define UART_BR38K4			UART_BR38400
#define UART_BR43K			UART_BR43000
#define UART_BR57K6			UART_BR57600
#define UART_BR76K8			UART_BR76800
#define UART_BR115K2		UART_BR115200
#define UART_BR128K			UART_BR128000
#define UART_BR256K			UART_BR256000
#define UART_BR460K8		UART_BR460800
#define UART_BR512K			UART_BR512000
#define UART_BR576K			UART_BR576000
#define UART_BR921K6		UART_BR921600
#define UART_BR1M			UART_BR1000000
#define UART_BR1M25			UART_BR1250000
#define UART_BR1M5			UART_BR1500000
#define UART_BR2M			UART_BR2000000

//initiate the hardware usart
//for uart0
void uart0Init(unsigned long baud_rate);	//initiate the hardware usart
#define uart0Putch(ch)		do {uart0Wait(); UART0->TDW=(ch);} while (0)							//void uart1Putch(char ch);					//send a char
void uart0Puts(char *str);					//send a string
//void uart0Putline(char *ln);				//send a string + line return
#define uart0Putline(str)	do {uart1Puts(str); uart1Puts("\r\n");} while (0)
#define uart0Getch()		(UART0->RDW)				//uint8_t uart1Getch(void);					//read a char from usart
#define uart0Available()	(UART0->FIFOS & (0x3f<<6))	//uint16_t uart1Available(void);			//test if data rx is available
#define uart0Busy()			(UART0->FIFOS & (0x3f<<0))	//(!(UART0->INTS & (1<<1)))	//uint16_t uart1Busy(void);					//test if uart tx is busy
#define uart0Wait()			while (uart0Busy())
void u0Print(char *str, int32_t dat);		//print to uart0
#define u0Println()			uart0Puts("\r\n")
//for compatability
#define uart0Put(ch)		uart0Putch(ch)
#define uart0Get()			uart0Getch()
#define uart0bps()			(F_UART / (((UART0->BAUDR & 0xffff) + 1) * 16 + (UART0->BAUDR >> 16)))
#define u0bps()				uart0bps()

