dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//using circular buffer for uart0 transmission
#define uart0TXFull()		(uart0Busy() == (0x3f<<0))	//test if TX FIFO is full
void u0CBInit(CB_TypeDef *cb, uint32_t bps);		//initialize uart0 using cb
void u0CBTX(CB_TypeDef *cb);						// transmit on uart0 using CB

//for uart1
void uart1Init(unsigned long baud_rate);
#define uart1Putch(ch)		do {uart1Wait(); UART1->TDW=(ch);} while (0)							//void uart1Putch(char ch);					//send a char
void uart1Puts(char *str);					//send a string
//void uart1Putline(char *ln);				//send a string + line return
#define uart1Putline(str)	do {uart1Puts(str); uart1Puts("\r\n");} while (0)
#define uart1Getch()		(UART1->RDW)				//uint8_t uart1Getch(void);					//read a char from usart
#define uart1Available()	(UART1->FIFOS & (0x3f<<6))	//uint16_t uart1Available(void);			//test if data rx is available
#define uart1Busy()			(UART1->FIFOS & (0x3f<<0))	//(!(UART0->INTS & (1<<1)))	//uint16_t uart1Busy(void);					//test if uart tx is busy
#define uart1Wait()			while (uart1Busy())
void u1Print(char *str, int32_t dat);		//print to uart1
#define u1Println()			uart1Puts("\r\n")
//for compatability
#define uart1Put(ch)		uart1Putch(ch)
#define uart1Get()			uart1Getch()
#define uart1bps()			(F_UART / (((UART1->BAUDR & 0xffff) + 1) * 16 + (UART1->BAUDR >> 16)))
#define u1bps()				uart1bps()

//using circular buffer for uart1 transmission
#define uart1TXFull()		(uart1Busy() == (0x3f<<0))	//test if TX FIFO is full
void u1CBInit(CB_TypeDef *cb, uint32_t bps);		//initialize uart0 using cb
void u1CBTX(CB_TypeDef *cb);						// transmit on uart0 using CB

//for uart2
//initiate the hardware usart
void uart2Init(unsigned long baud_rate);
#define uart2Putch(ch)		do {uart2Wait(); UART2->TDW=(ch);} while (0)							//void uart1Putch(char ch);					//send a char
void uart2Puts(char *str);					//send a string
//void uart2Putline(char *ln);				//send a string + line return
#define uart2Putline(str)	do {uart2Puts(str); uart2Puts("\r\n");} while (0)
#define uart2Getch()		(UART2->RDW)				//uint8_t uart1Getch(void);					//read a char from usart
#define uart2Available()	(UART2->FIFOS & (0x3f<<6))	//uint16_t uart1Available(void);			//test if data rx is available
#define uart2Busy()			(UART2->FIFOS & (0x3f<<0))	//(!(UART0->INTS & (1<<1)))	//uint16_t uart1Busy(void);					//test if uart tx is busy
#define uart2Wait()			while (uart2Busy())
void u2Print(char *str, int32_t dat);		//print to uart2
#define u2Println()			uart2Puts("\r\n")
//for compatability
#define uart2Put(ch)		uart2Putch(ch)
#define uart2Get()			uart2Getch()
#define uart2bps()			(F_UART / (((UART2->BAUDR & 0xffff) + 1) * 16 + (UART2->BAUDR >> 16)))
#define u2bps()				uart2bps()

//using circular buffer for uart0 transmission
#define uart2TXFull()		(uart2Busy() == (0x3f<<0))	//test if TX FIFO is full
void u2CBInit(CB_TypeDef *cb, uint32_t bps);		//initialize uart0 using cb
void u2CBTX(CB_TypeDef *cb);						// transmit on uart0 using CB

//for uart3
//initiate the hardware usart
void uart3Init(unsigned long baud_rate);
#define uart3Putch(ch)		do {uart3Wait(); UART3->TDW=(ch);} while (0)							//void uart1Putch(char ch);					//send a char
void uart3Puts(char *str);					//send a string
//void uart3Putline(char *ln);				//send a string + line return
#define uart3Putline(str)	do {uart3Puts(str); uart3Puts("\r\n");} while (0)
#define uart3Getch()		(UART3->RDW)				//uint8_t uart1Getch(void);					//read a char from usart
#define uart3Available()	(UART3->FIFOS & (0x3f<<6))	//uint16_t uart1Available(void);			//test if data rx is available
#define uart3Busy()			(UART3->FIFOS & (0x3f<<0))	//(!(UART0->INTS & (1<<1)))	//uint16_t uart1Busy(void);					//test if uart tx is busy
#define uart3Wait()			while (uart3Busy())
void u3Print(char *str, int32_t dat);		//print to uart1
#define u3Println()			uart3Puts("\r\n")
//for compatability
#define uart3Put(ch)		uart3Putch(ch)
#define uart3Get()			uart3Getch()
#define uart3bps()			(F_UART / (((UART3->BAUDR & 0xffff) + 1) * 16 + (UART3->BAUDR >> 16)))
#define u3bps()				uart3bps()

//using circular buffer for uart0 transmission
#define uart3TXFull()		(uart3Busy() == (0x3f<<0))	//test if TX FIFO is full
void u3CBInit(CB_TypeDef *cb, uint32_t bps);		//initialize uart0 using cb
void u3CBTX(CB_TypeDef *cb);						// transmit on uart0 using CB

//for uart4
//initiate the hardware usart
void uart4Init(unsigned long baud_rate);
#define uart4Putch(ch)		do {uart4Wait(); UART4->TDW=(ch);} while (0)							//void uart1Putch(char ch);					//send a char
void uart4Puts(char *str);					//send a string
//void uart3Putline(char *ln);				//send a string + line return
#define uart4Putline(str)	do {uart4Puts(str); uart4Puts("\r\n");} while (0)
#define uart4Getch()		(UART4->RDW)				//uint8_t uart1Getch(void);					//read a char from usart
#define uart4Available()	(UART4->FIFOS & (0x3f<<6))	//uint16_t uart1Available(void);			//test if data rx is available
#define uart4Busy()			(UART4->FIFOS & (0x3f<<0))	//(!(UART0->INTS & (1<<1)))	//uint16_t uart1Busy(void);					//test if uart tx is busy
#define uart4Wait()			while (uart4Busy())
void u4Print(char *str, int32_t dat);		//print to uart1
#define u4Println()			uart4Puts("\r\n")
//for compatability
#define uart4Put(ch)		uart4Putch(ch)
#define uart4Get()			uart4Getch()
#define uart4bps()			(F_UART / (((UART4->BAUDR & 0xffff) + 1) * 16 + (UART4->BAUDR >> 16)))
#define u4bps()				uart4bps()

//using circular buffer for uart0 transmission
#define uart4TXFull()		(uart4Busy() == (0x3f<<0))	//test if TX FIFO is full
void u4CBInit(CB_TypeDef *cb, uint32_t bps);		//initialize uart0 using cb
void u4CBTX(CB_TypeDef *cb);						// transmit on uart0 using CB

//for uart5
//initiate the hardware usart
void uart5Init(unsigned long baud_rate);
#define uart5Putch(ch)		do {uart5Wait(); UART5->TDW=(ch);} while (0)							//void uart1Putch(char ch);					//send a char
void uart5Puts(char *str);					//send a string
//void uart5Putline(char *ln);				//send a string + line return
#define uart5Putline(str)	do {uart5Puts(str); uart5Puts("\r\n");} while (0)
#define uart5Getch()		(UART5->RDW)				//uint8_t uart1Getch(void);					//read a char from usart
#define uart5Available()	(UART5->FIFOS & (0x3f<<6))	//uint16_t uart1Available(void);			//test if data rx is available
#define uart5Busy()			(UART5->FIFOS & (0x3f<<0))	//(!(UART0->INTS & (1<<1)))	//uint16_t uart1Busy(void);					//test if uart tx is busy
#define uart5Wait()			while (uart5Busy())
void u5Print(char *str, int32_t dat);		//print to uart1
#define u5Println()			uart5Puts("\r\n")
//for compatability
#define uart5Put(ch)		uart5Putch(ch)
#define uart5Get()			uart5Getch()
#define uart5bps()			(F_UART / (((UART5->BAUDR & 0xffff) + 1) * 16 + (UART5->BAUDR >> 16)))
#define u5bps()				uart5bps()

