dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//using circular buffer for uart0 transmission
#define uart5TXFull()		(uart5Busy() == (0x3f<<0))	//test if TX FIFO is full
void u5CBInit(CB_TypeDef *cb, uint32_t bps);		//initialize uart5 using cb
void u5CBTX(CB_TypeDef *cb);						// transmit on uart5 using CB

//end Serial

//timer
#define tmrSetPS(ps)	do {RCC->CLK_EN |= (1<<10);	TIM->TMR_CONFIG = (ps) & 0x7f;} while (0)	//set timer's prescaler. bits 6..0
#define tmrGetPS()		(TIM->TMR_CONFIG & 0x7f)
//tmr0
void tmr0Init(void);						//initialize timer: repeat counter up to 0xffffffff, no interrupt
void tmr0AttachISR(void (*isrptr)(void));	//install user isr
#define tmr0SetPR(pr)	TIM->TIM0_PRD=(pr)	//set timer's period
#define tmr0GetPR()		(TIM->TIM0_PRD)

//tmr1
void tmr1Init(void);						//initialize timer: repeat counter up to 0xffffffff, no interrupt
void tmr1AttachISR(void (*isrptr)(void));	//install user isr
#define tmr1SetPR(pr)	TIM->TIM1_PRD=(pr)	//set timer's period
#define tmr1GetPR()		(TIM->TIM1_PRD)

//tmr2
void tmr2Init(void);						//initialize timer: repeat counter up to 0xffffffff, no interrupt
void tmr2AttachISR(void (*isrptr)(void));	//install user isr
#define tmr2SetPR(pr)	TIM->TIM2_PRD=(pr)	//set timer's period
#define tmr2GetPR()		(TIM->TIM2_PRD)

//tmr3
void tmr3Init(void);						//initialize timer: repeat counter up to 0xffffffff, no interrupt
void tmr3AttachISR(void (*isrptr)(void));	//install user isr
#define tmr3SetPR(pr)	TIM->TIM3_PRD=(pr)	//set timer's period
#define tmr3GetPR()		(TIM->TIM3_PRD)

//tmr4
void tmr4Init(void);						//initialize timer: repeat counter up to 0xffffffff, no interrupt
void tmr4AttachISR(void (*isrptr)(void));	//install user isr
#define tmr4SetPR(pr)	TIM->TIM4_PRD=(pr)	//set timer's period
#define tmr4GetPR()		(TIM->TIM4_PRD)

//tmr5
void tmr5Init(void);						//initialize timer: repeat counter up to 0xffffffff, no interrupt
void tmr5AttachISR(void (*isrptr)(void));	//install user isr
#define tmr5SetPR(pr)	TIM->TIM5_PRD=(pr)	//set timer's period
#define tmr5GetPR()		(TIM->TIM5_PRD)

//end timer

//pwm
void pwm0Init(void);						//initialize pwm
#define PWM0SetPS(ps)	do {PWM->CLKDIV01 = (PWM->CLKDIV01 &~(0xffff << (0*16))) | (((ps) & 0xffff) << (0*16));} while (0)
#define PWM0SetPR(pr)	do {PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (0*8))) | (((pr) & 0xff) << (0*8));} while (0)	
#define PWM0SetDC(dc)	do {PWM->CMPDAT =   (PWM->CMPDAT &~(0xff << (0*8))) | (((dc) & 0xff) << (0*8));} while (0)
#define PWM0PolPos(p)	PWM->CR &=~(1 << 2)	//pwm output is positive polarity. bit 5..2 for ch 3..0
#define PWM0PolNeg(p)	PWM->CR |= (1 << 2)	//pwm output is negative polarity. bit 5..2 for ch 3..0
#define PWM0GetPS()		((PWM->CLKDIV01 >> (0*16)) & 0xffff)
#define PWM0GetPR()		((PWM->PERIOD >> (0*8)) & 0xff)
#define PWM0GetDC()		((PWM->CMPDAT >> (0*8)) & 0xff)

void pwm1Init(void);						//initialize pwm
#define PWM1SetPS(ps)	do {PWM->CLKDIV01 = (PWM->CLKDIV01 &~(0xffff << (1*16))) | (((ps) & 0xffff) << (1*16));} while (0)
#define PWM1SetPR(pr)	do {PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (1*8))) | (((pr) & 0xff) << (1*8));} while (0)	
#define PWM1SetDC(dc)	do {PWM->CMPDAT =   (PWM->CMPDAT &~(0xff << (1*8))) | (((dc) & 0xff) << (1*8));} while (0)
#define PWM1PolPos(p)	PWM->CR &=~(1 << 3)	//pwm output is positive polarity. bit 5..2 for ch 3..0
#define PWM1PolNeg(p)	PWM->CR |= (1 << 3)	//pwm output is negative polarity. bit 5..2 for ch 3..0
#define PWM1GetPS()		((PWM->CLKDIV01 >> (1*16)) & 0xffff)
#define PWM1GetPR()		((PWM->PERIOD >> (1*8)) & 0xff)
#define PWM1GetDC()		((PWM->CMPDAT >> (1*8)) & 0xff)

void pwm2Init(void);						//initialize pwm
#define PWM2SetPS(ps)	do {PWM->CLKDIV23 = (PWM->CLKDIV23 &~(0xffff << (0*16))) | (((ps) & 0xffff) << (0*16));} while (0)
#define PWM2SetPR(pr)	do {PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (2*8))) | (((pr) & 0xff) << (2*8));} while (0)	
#define PWM2SetDC(dc)	do {PWM->CMPDAT =   (PWM->CMPDAT &~(0xff << (2*8))) | (((dc) & 0xff) << (2*8));} while (0)
#define PWM2PolPos(p)	PWM->CR &=~(1 << 4)	//pwm output is positive polarity. bit 5..2 for ch 3..0
#define PWM2PolNeg(p)	PWM->CR |= (1 << 4)	//pwm output is negative polarity. bit 5..2 for ch 3..0
#define PWM2GetPS()		((PWM->CLKDIV23 >> (0*16)) & 0xffff)
#define PWM2GetPR()		((PWM->PERIOD >> (2*8)) & 0xff)
#define PWM2GetDC()		((PWM->CMPDAT >> (2*8)) & 0xff)

void pwm3Init(void);						//initialize pwm
#define PWM3SetPS(ps)	do {PWM->CLKDIV23 = (PWM->CLKDIV23 &~(0xffff << (1*16))) | (((ps) & 0xffff) << (1*16));} while (0)
#define PWM3SetPR(pr)	do {PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (3*8))) | (((pr) & 0xff) << (3*8));} while (0)	
#define PWM3SetDC(dc)	do {PWM->CMPDAT =   (PWM->CMPDAT &~(0xff << (3*8))) | (((dc) & 0xff) << (3*8));} while (0)
#define PWM3PolPos(p)	PWM->CR &=~(1 << 5)	//pwm output is positive polarity. bit 5..2 for ch 3..0
#define PWM3PolNeg(p)	PWM->CR |= (1 << 5)	//pwm output is negative polarity. bit 5..2 for ch 3..0
#define PWM3GetPS()		((PWM->CLKDIV23 >> (1*16)) & 0xffff)
#define PWM3GetPR()		((PWM->PERIOD >> (3*8)) & 0xff)
#define PWM3GetDC()		((PWM->CMPDAT >> (3*8)) & 0xff)

//pwm4 is special - code below is bespoke to pwm4
void pwm4Init(void);						//initialize pwm
#define PWM4SetPS(ps)	do {PWM->CH4CR1 = 	(PWM->CH4CR1 &~(0xffff << (1*16))) | (((ps) & 0xffff) << (1*16));} while (0)
#define PWM4SetPR(pr)	do {PWM->CH4CR1 = 	(PWM->CH4CR1 &~(0xff << (1*8))) | (((pr) & 0xff) << (1*8));} while (0)	
#define PWM4SetDC(dc)	do {PWM->CH4CR2 =   (PWM->CH4CR2 &~(0xff << (1*8))) | (((dc) & 0xff) << (1*8));} while (0)
#define PWM4PolPos(p)	PWM->CH4CR2 &=~(1 << 0)	//pwm output is positive polarity
#define PWM4PolNeg(p)	PWM->CH4CR2 |= (1 << 0)	//pwm output is negative polarity
#define PWM4GetPS()		((PWM->CH4CR1 >> 16) & 0xffff)
#define PWM4GetPR()		((PWM->CH4CR1 >>  8) & 0xff)
#define PWM4GetDC()		((PWM->CH4CR2 >>  8) & 0xff)
//end pwm

//pmu
//initialize pmu
void pmuInit(void);									//initialize pmu
//void pmuStartT0(uint32_t sec);					//start timer0
#define pmuSetT0(sec)					do {PMU->TIMER0  = 	(1<<16) | ((sec) & 0xffff);} while (0)
#define pmuGetT0()						((PMU->TIMER0) & 0xffff)
//void pmuStartT1(uint32_t sec);					//start timer1
#define pmuSetT1(sec)					do {PMU->RSV     = 	(1<<16) | ((sec) & 0xffff);} while (0)
#define pmuGetT1()						((PMU->RSV   ) & 0xfffff)
#define pmuRTC0()		(PMU->RTCCR0)
#define pmuRTC1()		(PMU->RTCCR1)
#define rtcOSC2RC()		IO_SET(PMU->CR, 1<<4)		//rtc on RC oscillator
#define rtcOSC2Xtal()	IO_CLR(PMU->CR, 1<<4)		//rtc on main crystal oscillator
#define rtcOSCCalib()	do {IO_CLR(PMU->CR, 1<<3); IO_SET(PMU->CR, 1<<3);} while (0)		//1->start rc calibration, 0->no effect
#define rtcSecGet()		((pmuRTC0() >> 0) & 0x3f)
#define rtcMinGet()		((pmuRTC0() >> 8) & 0x3f)	//datasheet is missing this item. see wm_regs.h
#define rtcHourGet()	((pmuRTC0() >>16) & 0x1f)
#define rtcDayGet()		((pmuRTC0() >>24) & 0x1f)
#define rtcMonGet()		((pmuRTC1() >> 0) & 0x0f)
#define rtcYearGet()	((pmuRTC1() >> 8) & 0x7f)
//clear rtc1's bit 16 before setting the time
//set rtc1's bit 16 to enable timing
#define rtcSecSet(x)	do {pmuRTC1() &=~(1<<16); (pmuRTC0() = (pmuRTC0() &~(0x3f << 0)) | (((x) & 0x3f) << 0)); pmuRTC1() |= (1<<16);} while (0)
#define rtcMinSet(x)	do {pmuRTC1() &=~(1<<16); (pmuRTC0() = (pmuRTC0() &~(0x3f << 8)) | (((x) & 0x3f) << 8)); pmuRTC1() |= (1<<16);} while (0)
#define rtcHourSet(x)	do {pmuRTC1() &=~(1<<16); (pmuRTC0() = (pmuRTC0() &~(0x1f <<16)) | (((x) & 0x1f) <<16)); pmuRTC1() |= (1<<16);} while (0)
#define rtcDaySet(x)	do {pmuRTC1() &=~(1<<16); (pmuRTC0() = (pmuRTC0() &~(0x1f <<24)) | (((x) & 0x1f) <<24)); pmuRTC1() |= (1<<16);} while (0)
#define rtcMonSet(x)	do {pmuRTC1() &=~(1<<16); (pmuRTC1() = (pmuRTC1() &~(0x0f << 0)) | (((x) & 0x0f) << 0)); pmuRTC1() |= (1<<16);} while (0)
#define rtcYearSet(x)	do {pmuRTC1() &=~(1<<16); (pmuRTC1() = (pmuRTC1() &~(0x7f << 8)) | (((x) & 0x7f) << 8)); pmuRTC1() |= (1<<16);} while (0)
//end pmu

//wdg
void wdgInit(void);									//reset wdg, interrupt disabled
void wdgAttachISR(void (*isrptr)(void));			//install user isr
#define wdgGet()		(WDG->VAL)					//get wdg value
#define wdgSet(pr)		WDG->LD = (pr)				//set period
#define wdgIFGet()		((WDG->STATE) & (1<<0))		//1->interrupt has happened, 0->not yet happend
#define wdgIFClr()		WDG->CLR = 0				//write any to clear the flg
//end wdg

