dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//end arduino declaration

//adc
//adc input channels
#define ADC_CH0			0b0000			//adc ch0
#define ADC_CH1			0b0001			//adc ch1
#define ADC_CH2			0b0010			//adc ch2
#define ADC_CH3			0b0011			//adc ch3
#define ADC_CH01		0b1000			//adc ch0 vs. ch1
#define ADC_CH23		0b1001			//adc ch2 vs. ch3
#define ADC_TEMP		0b1100			//temperature sensor
#define ADC_VLDO		0b1101			//LDO output = 2.5v
#define ADC_OFST		0b1110			//adc ch for offset measurement
#define ADC_ARAND		ADC_CH0			//use temp generator for random number generation
//pga gain
//pga gain1
#define PGA1_x1			0b000			//pga1 gain
#define PGA1_x16		0b001			//pga1 gain
#define PGA1_x32		0b010			//pga1 gain
#define PGA1_x64		0b011			//pga1 gain
#define PGA1_x128		0b100			//pga1 gain
#define PGA1_x256		0b101			//pga1 gain
//pga gain 2
#define PGA2_x1			0b00			//pga2 gain
#define PGA2_x2			0b01			//pga2 gain
#define PGA2_x3			0b10			//pga2 gain
#define PGA2_x4			0b11			//pga2 gain
//pga gain combination
#define PGAx1			(PGA1_x1   | (PGA2_x1 << 3))
#define PGAx2			(PGA1_x1   | (PGA2_x2 << 3))
#define PGAx3			(PGA1_x1   | (PGA2_x3 << 3))
#define PGAx4			(PGA1_x1   | (PGA2_x4 << 3))
#define PGAx16			(PGA1_x16  | (PGA2_x1 << 3))
#define PGAx32			(PGA1_x16  | (PGA2_x2 << 3))
#define PGAx48			(PGA1_x16  | (PGA2_x3 << 3))
#define PGAx64			(PGA1_x16  | (PGA2_x4 << 3))
#define PGAx96			(PGA1_x32  | (PGA2_x3 << 3))
#define PGAx128			(PGA1_x32  | (PGA2_x4 << 3))
#define PGAx192			(PGA1_x64  | (PGA2_x3 << 3))
#define PGAx256			(PGA1_x64  | (PGA2_x4 << 3))
#define PGAx384			(PGA1_x128 | (PGA2_x3 << 3))
#define PGAx512			(PGA1_x128 | (PGA2_x4 << 3))
#define PGAx768			(PGA1_x256 | (PGA2_x3 << 3))
#define PGAx1024		(PGA1_x256 | (PGA2_x4 << 3))

void adcInit(void);									//reset the adc
uint32_t adcRead(uint8_t ch);						//read an adc channel
#define analogRead(ch)	adcRead(ch)					//map to arduino
uint32_t adcReadN(uint8_t ch, uint8_t N);			//read adc multiples and return the average
#define adcSetGain(g)	ADC->PGA_CR = (ADC->PGA_CR &~(0x1f << 4)) | (((g) & 0x1f) << 4)
#define ADC_DLY()		delay(2)					//delay 2ms after a channel switch, per the datasheet
#define adcOffset(n)	adcReadN(ADC_OFST, n)		//return adc readings for ADC_OFST / n runs
#define adcSetVcm(g)	do {PGA_VCMIN = (PGA_VCMIN &~(0x3f << 11)) | (((g) & 0x3f) << 11);} while (0)
#define adcGetVcm()		((PGA_VCMIN >> 11) & 0x3f)
#define Vcmx1k()		(adcGetVcm() * 1311 / 32)	//return Vcm (default 1311mv at Vcm=32), in mv
uint32_t adcReadVcc(void);							//read the chip's own power supply voltage, Vcc, in mv
//read the chip's own power supply / Vcc, in mv: a very convoluted process, per the datasheet
//8x oversampling
//per datasheet: Vcc = (codeout - offset)*68.5uv/2 + 1.2v, codeout and offset in 16 bit form
//or Vcc = (codeout - offset) * 685 / 20000 + 1200, in mv
 int32_t adcReadmv(uint8_t ch, uint8_t gain);		//read input channel, pga gain = 2x, return in mv
#define adcReadmv1x(ch)		adcReadmv(ch, PGAx1)	//read adc
#define adcReadmv2x(ch)		adcReadmv(ch, PGAx2)	//read adc
#define adcReadmv3x(ch)		adcReadmv(ch, PGAx3)	//read adc
#define adcReadmv4x(ch)		adcReadmv(ch, PGAx4)	//read adc
#define adcReadmv16x(ch)	adcReadmv(ch, PGAx16)	//read adc
#define adcReadmv32x(ch)	adcReadmv(ch, PGAx32)	//read adc
#define adcReadmv48x(ch)	adcReadmv(ch, PGAx48)	//read adc
#define adcReadmv64x(ch)	adcReadmv(ch, PGAx64)	//read adc
#define adcReadmv96x(ch)	adcReadmv(ch, PGAx96)	//read adc
#define adcReadmv128x(ch)	adcReadmv(ch, PGAx128)	//read adc
#define adcReadmv192x(ch)	adcReadmv(ch, PGAx192)	//read adc
#define adcReadmv256x(ch)	adcReadmv(ch, PGAx256)	//read adc
#define adcReadmv384x(ch)	adcReadmv(ch, PGAx384)	//read adc
#define adcReadmv512x(ch)	adcReadmv(ch, PGAx512)	//read adc
#define adcReadmv768x(ch)	adcReadmv(ch, PGAx768)	//read adc
#define adcReadmv1024x(ch)	adcReadmv(ch, PGAx1024)	//read adc
 int32_t adcReadTempx16(void);						//read the temp. returns a reading 16x of Vtemp in the datasheet
//Approach #1 for temperature measurement:
//some math here
//per datasheet, Vtemp = 15.548*TempC + 4444.1
//or (Vtempx16) / 16 = 15.548 * TempC + 4444.1, or
//(Vtempx16) / 16 - 4444.1 = 15.548 * TempC, or 
// TempC = (Vtempx16 / 16 - 4444.1) / 15.548, or 
// TempCx100 = (Vtempx16 * 100 / 16 - 444410)*1000 / 15548
//#define adcReadTempCx100()	((adcReadTempx16() * 100 / 16 - 444410ul) * 1000 / 15548)				//this yields a reading that's about 10F too low.
//Approach #2:
//W801 SDK, in wm_adc.c, suggests a slightly different measurement
//Vetemp = 15.548*TempC + 4120.702
//#define adcReadTempCx100()	((adcReadTempx16() * 100 / 16 - 412070ul) * 1000 / 15548)				//this yields a reading that's about 30F too high.
//Approach #3:
//based on that, we change the constant to hit the ambient temperature at 68.2F, at time of this testing
#define adcReadTempCx100()	((adcReadTempx16() * 100 / 16 - 444410ul + 9350) * 1000 / 15548)			//this yields a reading that's about right. 
//on the error term: +1C=~+1550, 1F=860
#define adcReadTempFx100()	(adcReadTempCx100() * 9 / 5 + 3200)	//perform a C-to-F conversion. C=F*9/5+32

//random number generators
#define arand1()			(analogRead(ADC_ARAND) & 0x01)	//generate 1-bit random number
uint8_t arand4(void);							//generate 4-bit random numbers
uint8_t arand8(void);							//generate 8-bit random numbers
uint16_t arand16(void);							//generate 16-bit random numbers
uint32_t arand32(void);							//generate 32-bit random numbers
//end adc

//touch
void TSInit(void);								//reset the touch sensors
#define TSOn()			TOUCH->CR |= (0<<0)		//1->enable touch, 0->disable touch
#define TSOff()			TOUCH->CR &=~(0<<0)		//1->enable touch, 0->disable touch
void TSSetTHS(PIN_TypeDef pin, uint8_t ths);	//set the touch threshold
uint8_t TSGetTHS(PIN_TypeDef pin);				//get threshold. default = 50
void TSEnable(PIN_TypeDef pin);					//enable touch on a pin
#define TSIFGet()		(TOUCH->IE_IF & (0xffff))
#define TSIFClr()		TOUCH->IE_IF |= (0xffff)

//end touch

//lcd
void LCDInit(void);								//reset the lcd
//end lcd

//spi
void spiInit(void);								//reset the spi
uint8_t spiWrite(uint8_t dat);					//send a byte to tx fifo
void spiWrites(uint8_t *dat, uint32_t bytes);	//transmit a buffer
#define spiRead()		(SPI-RXDATA)							//read a byte from rx fifo
#define spiBusy()		(((SPI->STATUS >> 0) & 0x3f) == 0x3f)	//tx fifo is full
#define spiWait()		while (spiBusy())						//wait for tx buffer to free up
#define spiAvailable()	((SPI->STATUS >> 11) & 0x3f)			//number of bytes in rx fifo
//end spi

