dannyf00/Arduino-Clone-for-W801-W806/w801duino.h
//i2c
#define I2C_ACK			0
#define I2C_NOACK		1
#define I2C_CMD_WRITE	0
#define I2C_CMD_READ	1
#define I2C_STOP		1
#define I2C_ACK_ERROR	9

void i2cInit(void);												//reset the i2c
uint8_t i2cWrites(uint8_t devaddr, uint8_t regaddr, uint8_t *dat, uint32_t bytes); 	//write multiple bytes byte to slave
uint8_t i2cWrite(uint8_t dat, uint8_t ifstart);					//send a byte. 1=start, 0=otherwise
uint8_t i2cRead(uint8_t ack_noack, uint8_t ifstop);				//read a byte. I2C_ACK/I2C_NOACK, 1=stop, 0->no stop
uint8_t i2cReads(uint8_t devaddr, uint8_t regaddr, uint8_t *dat, uint32_t bytes);	//read multiple bytes from slave
//end i2c

//software i2c
//software i2c
void sI2CInit(void);									//reset the software i2c
void sI2CStart(void);									//send a start condition
void sI2CStop(void);									//send a stop condition
uint8_t sI2CWrite(uint8_t dat);							//send a i2c byte
uint8_t sI2CRead(uint8_t ack);							//read i2c data
//write from a buffer
uint8_t sI2CWrites(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite);
//read to a buffer
uint8_t sI2CReads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead);
//end software i2c

//true random number generator
//global defines
#define GPSEC_BASE			0x40000600

typedef struct {
	__IOM uint32_t SRC;					//source register @ 0x00
	__IOM uint32_t DEST;				//destination / decrypted text register @ 0x04
	__IOM uint32_t CFG;					//configuration register @ 0x08
	__IOM uint32_t CTRL;				//controll register @ 0x0c
	__IOM uint32_t KEY0;				//key0 register @ 0x10
	__IOM uint32_t KEY1;				//key1 register @ 0x14
	__IOM uint32_t KEY2;				//key2 register @ 0x18
	__IOM uint32_t KEY3;				//key3 register @ 0x1c
	__IOM uint32_t KEY4;				//key4 register = crc key / result register @ 0x20
	__IOM uint32_t KEY5;				//key5 register @ 0x24
	__IOM uint32_t IV0;					//iv0 register @ 0x28
	__IOM uint32_t IV1;					//iv1 register @ 0x2c
	__IOM uint32_t STS;					//status register @ 0x30
	__IOM uint32_t SHA1_DIGEST0;		//sha1/md5 digest0 register @ 0x34
	__IOM uint32_t SHA1_DIGEST1;		//sha1/md5 digest1 register @ 0x38
	__IOM uint32_t SHA1_DIGEST2;		//sha1/md5 digest2 register @ 0x3c
	__IOM uint32_t SHA1_DIGEST3;		//sha1/md5 digest3 register # 0x40
	__IOM uint32_t SHA1_DIGEST4;		//sha1/md5 digest4 register @ 0x44
	__IOM uint32_t RNG_RESULT;			//random number result register # 0x48
	__IOM uint32_t KEY6;				//key6 register @ 0x4c
	__IOM uint32_t KEY7;				//key7 register @ 0x50
	__IOM uint32_t TRNG_CR;				//true random number control register @ 0x54
} GPSEC_TypeDef;

#define GPSEC				((GPSEC_TypeDef *) GPSEC_BASE)

//global variables

//initialize the 32-bit random number generator
//digital post processing enabled: bit 2 = 0
//generate true random numbers: bit 1 = 0
void trngInit(void);					//true 32-bit random number generator
void prngInit(void);					//pseudo 32-bit random number generator
#define rngGet()		(GPSEC->RNG_RESULT)		//read rng result

//end trng

//circular buffer

void cbInit(CB_TypeDef *cbuffer);		//reset the cbuffer
char cbEmpty(CB_TypeDef *cbuffer);		//returns true if cbuffer is empty
char cbFull(CB_TypeDef *cbuffer);		//returns true if cbuffer is full;
cbuffer_t cbWrite(CB_TypeDef *cbuffer, cbuffer_t dat);	//write to the buffer - needs to test if the buffer is full first
cbuffer_t cbRead(CB_TypeDef *cbuffer);	//read from the buffer - needs to test if the buffer is empty
void str2cb(CB_TypeDef *cb, char *str);	//write string to CB
void cb2str(char *str, CB_TypeDef *cb);	//write CB to string
//end circular buffer

//input capture on pwm0/4
void ic0Init(void);						//initialize input capture on pwm0
#define ic0Get()			(PWM->CH0CAPDAT)
#define ic0Available()					//ic0 capture available - not implemented
void ic4Init(void);						//initialize input capture on pwm4
#define ic4Get()			(PWM->CH4CAPDAT)
#define ic4Available()					//ic4 capture available - not implemented
//end input capture

#endif	//_W801DUINO_H
